In [7]:
import pandas as pd

In [8]:
## Series

import pandas as pd
data=[1,2,3,4,5]
series=pd.Series(data)
print("Series \n",series);print(type(series))

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [9]:
## Series from dictionary
data={'a':1,'b':2,'c':3}
series_dict=pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [10]:
data=[10,20,30]
index=['a','b','c']
series=pd.Series(data,index)
print(series)

a    10
b    20
c    30
dtype: int64

In [11]:
## Dataframe
## create a dataframe from a dictionary of list

data={
    'Name':['Krish','Jack','John'],
    'Age':[25,30,45],
    'City':['Delhi','Noida','Agra']
}
df=pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age   City
0  Krish   25  Delhi
1   Jack   30  Noida
2   John   45   Agra
<class 'pandas.core.frame.DataFrame'>

In [12]:
import numpy as np
np.array(df)

array([['Krish', 25, 'Delhi'],
       ['Jack', 30, 'Noida'],
       ['John', 45, 'Agra']], dtype=object)

In [13]:
## create a dataframe from a list of dictionary

data=[
    {'Name':'Krish','Age':32,'City':'Delhi'},
    {'Name':'John','Age':32,'City':'Delhi'},
    {'Name':'Bappy','Age':32,'City':'Delhi'},
    {'Name':'Jack','Age':32,'City':'Delhi'},
]
df=pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age   City
0  Krish   32  Delhi
1   John   32  Delhi
2  Bappy   32  Delhi
3   Jack   32  Delhi
<class 'pandas.core.frame.DataFrame'>

In [14]:
df=pd.read_csv('sales_data.csv')
df.head(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [15]:
df.tail(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [16]:
data={
    'Name':['Krish','Jack','John'],
    'Age':[25,30,45],
    'City':['Delhi','Noida','Agra']
}
df=pd.DataFrame(data)
print(df['Name'])
print(type(df['Name']))

0    Krish
1     Jack
2     John
Name: Name, dtype: object
<class 'pandas.core.series.Series'>

In [17]:
print(df.loc[0])
type(df.loc[0])

Name    Krish
Age        25
City    Delhi
Name: 0, dtype: object

pandas.core.series.Series

In [18]:
print(df.loc[0][0])
print(df.loc[0][1])
print(df.loc[0][2])
type(df.loc[0][0])

Krish
25
Delhi

C:\Users\91630\AppData\Local\Temp\ipykernel_28880\230876319.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(df.loc[0][0])
C:\Users\91630\AppData\Local\Temp\ipykernel_28880\230876319.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(df.loc[0][1])
C:\Users\91630\AppData\Local\Temp\ipykernel_28880\230876319.py:3: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(df.loc[0][2])
C:\Users\91630\AppData\Local\Temp\ipykernel_28880\230876319.py:4: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  type(df.loc[0][0])

str

In [19]:
print(df.iloc[0][2])

Delhi

C:\Users\91630\AppData\Local\Temp\ipykernel_28880\3514165159.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(df.iloc[0][2])

In [20]:
df

    Name  Age   City
0  Krish   25  Delhi
1   Jack   30  Noida
2   John   45   Agra

In [21]:
## Accessing a specified element

print(df.at[1,'Age'])   ### in age what is first column
print(df.at[2,'Name'])

30
John

In [24]:
## Accessing a specified element using iat

df.iat[2,2]   ## result of 2 i and 2 column

'Agra'

In [61]:
### Data MAnipulation with Dataframe

df

    Name  Age   City
0  Krish   25  Delhi
1   Jack   30  Noida
2   John   45   Agra

In [62]:
## Adding a column
df['salary']=[5000,6000,7000]
df

    Name  Age   City  salary
0  Krish   25  Delhi    5000
1   Jack   30  Noida    6000
2   John   45   Agra    7000

In [63]:
## Remove a column    drop is not permanent operation it is temporary it does not save the state of dataframe in order to make it permanent we have to add inplace=True
df.drop('salary',axis=1)   ## it will check only in row wise to make it column wise we have to make axis=1, for axis=0 it is row wise and if u dont provide anything by default it is 0

    Name  Age   City
0  Krish   25  Delhi
1   Jack   30  Noida
2   John   45   Agra

In [64]:
df

    Name  Age   City  salary
0  Krish   25  Delhi    5000
1   Jack   30  Noida    6000
2   John   45   Agra    7000

In [65]:
df.drop('salary',axis=1,inplace=True)

In [66]:
df

    Name  Age   City
0  Krish   25  Delhi
1   Jack   30  Noida
2   John   45   Agra

In [67]:
## Add age to the column

df['Age']=df['Age']+1

In [68]:
df

    Name  Age   City
0  Krish   26  Delhi
1   Jack   31  Noida
2   John   46   Agra

In [69]:
## Delete the row
df.drop(0,inplace=True)
df

   Name  Age   City
1  Jack   31  Noida
2  John   46   Agra

In [70]:
df=pd.read_csv('sales_data.csv')
df.head(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [72]:
## Statical summary
df.describe()

       Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000